Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །དཔེར་ན་ཡི་གེ་རྣམས་ནི་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པར་འབྱུང་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པར་སེམས་ཀྱི་དམིགས་པ་རྣམས་ལས་འབྱུང་ངོ་།
en: “As an analogy, words occur without having form or being demonstrable. Likewise, phenomena arise from the mind’s observations without having form or being demonstrable.

source: །དཔེར་ན་ཡི་གེ་རྣམས་ནི་སྐད་ཅིག་པ་དང་། ཡ་མ་བརླ་དང་། གསོབ་དང་། གསོག་ཡིན་ལ།
en: “As an analogy, words are momentary, meaningless, false, and deceptive, and they have no creators whatsoever.

source: དེ་རྣམས་ཀྱི་བྱེད་པ་པོ་འགའ་ཡང་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་པ་དང་། ཡ་མ་བརླ་དང་། གསོབ་དང་། གསོག་ཡིན་ལ་དེ་རྣམས་ཀྱི་བྱེད་པ་པོ་འགའ་ཡང་མེད་དོ།
en: Likewise, phenomena are momentary, meaningless, false, and deceptive, and they have no creators whatsoever.

source: །དཔེར་ན་ཡི་གེ་རྣམས་ནི་ཆགས་པ་ཡང་མེད། སྡང་བ་ཡང་མེད། རྨོངས་པ་ཡང་མེད་པར་འགྱུར་ལ། ཡི་གེའི་རྣམ་པར་རིག་བྱེད་དེས་ཀྱང་བྱིས་པ་རྣམས་རྗེས་སུ་ཆགས་པའམ། ཁོང་ཁྲོ་བའམ།
en: “As an analogy, while words cannot have attachment, aggression, or delusion, the communication of words can cause childish beings to be attached, aggressive, and deluded.

source: རྨོངས་པར་འགྱུར་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་ཆགས་པའང་མེད། སྡང་བ་ཡང་མེད། རྨོངས་པ་ཡང་མེད་པར་ཡོངས་སུ་རྟོགས་ལ་མངོན་པར་ཞེན་པས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེ་བར་འགྱུར་རོ།
en: Likewise, while all phenomena can be understood to be without attachment, aggression, or delusion, clinging generates attachment, aggression, and delusion.

source: །དཔེར་ན་ཡི་གེའི་བརྡས་ནི་འབྲས་བུ་ཐོབ་པར་ཡང་བསྟན་ལ་ཡི་གེ་རྣམས་ཀྱིས་ཐོབ་པ་ཡང་མེད།
en: “As an analogy, while it is taught that a result can be attained through designations composed of words, nothing is attained and actualized through words.

source: མངོན་སུམ་དུ་བྱ་བ་ཡང་མེད་པ་དེ་བཞིན་དུ་ཆོས་རྣམ་པར་གཞག་པས་འབྲས་བུ་ཐོབ་པ་བསྟན་མོད་ཀྱི། འདི་ལ་ཆོས་འགའི་འཐོབ་པའམ། མངོན་སུམ་དུ་བྱ་བ་ཡང་མེད་དོ།
en: Likewise, although it is taught that a result is attained through the presentation of Dharma, there is no thing therein that can be attained or actualized.

source: །དཔེར་ན་ཆོས་གང་ཡང་ཡི་གེ་རྣམས་ཀྱིས་མ་བསྡུས་པ་མེད་པ་དེ་བཞིན་དུ་ཆོས་གང་ཡང་བྱང་ཆུབ་ཀྱིས་མ་བསྡུས་པ་མེད་དེ།
en: “As an analogy, just as there is nothing at all that is not encapsulated in words, so there is nothing at all that is not encapsulated in awakening.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡི་གེ་རྣམས་ཁོ་ནས་བྱང་ཆུབ་ཚོལ་བར་བྱེད་དོ།
en: Nāga Lord, this being so, bodhisattvas who abide in the inexhaustible casket dhāraṇī seek awakening purely through words.

source: །ཡི་གེ་རྣམས་ཁོ་ནས་བྱང་ཆུབ་སྟོན་པར་བྱེད་དོ།
en: They teach awakening purely through words.

source: །ཡི་གེ་རྣམས་ཁོ་ནས་བྱང་ཆུབ་གླེང་བར་བྱེད་དོ།
en: They discuss awakening purely through words.

source: །ཡི་གེ་རྣམས་ཁོ་ནས་བྱང་ཆུབ་ལ་རེག་པར་བྱེད་དོ།། །།བམ་པོ་གསུམ་པ།
en: They reach awakening purely though words.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཐོབ་པས་སྟོབས་བཅུ་ཐོབ་པར་འགྱུར་རོ།
en: “Nāga Lord, bodhisattvas will attain the ten powers through attaining the inexhaustible casket dhāraṇī.

source: །མི་འཇིགས་པ་བཞི་དང་། མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། བླ་ན་མེད་པའི་ཤེས་རབ་ཐོབ་པར་འགྱུར་ཏེ། དེའི་ཤེས་རབ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་གཟུགས་མེད་པར་སྒྲོལ་བའོ། །ཉོན་མོངས་པ་ཐམས་ཅད་སྲེག་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའོ།
en: They will attain the fourfold fearlessness, the eighteen unshared qualities, the qualities of buddhahood, the thirty-two marks of a great being, the eighty minor marks, and unsurpassed insight.

source: །ཆུ་བོ་བཞི་ལས་སྒྲོལ་བའོ། །བདུད་བཞི་རྣམ་པར་འཇོམས་པའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་འཛུམ་པའི་བཞིན་སྟོན་པའོ། །སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱེད་པའོ། །ཤེས་རབ་རིན་པོ་ཆེའི་སེམས་ཡང་དག་པར་སྐྱེད་པའོ། །དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་འཆད་པར་བྱེད་པའོ། །ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པའོ། །ཉོན་མོངས་པའི་མཆེ་བ་ཕྱེ་མར་རློག་པའོ། །གསང་བ་གསུམ་གྱི་གསང་སྔགས་ཀྱིས་ཀུན་ཏུ་སྲུང་བའི་གཟུངས་སོ། །ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའོ། །ཉོན་མོངས་པའི་ཁུར་ལས་སྒྲོལ་བའོ། །འཇིགས་པ་དང་སྐྲག་པ་ཐམས་ཅད་དང་བྲལ་བའོ། །རྒྱ་ཆེ་ཞིང་ཟབ་པའི་ཆོས་ལ་ལྟ་བའོ། །སེང་གེའི་རྩལ་སྤྱོད་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བའོ། །མྱ་ངན་ལས་འདས་པའི་ལམ་དུ་འགྲོ་བའོ། །གཡོན་ཕྱོགས་ཀྱི་ལམ་ཡོངས་སུ་སྤོང་བའོ། །གཡས་ཕྱོགས་ཀྱི་ལམ་དུ་འཛུད་པའོ།
en: This insight liberates all beings into the formless state, burns all afflictions, ripens all beings, liberates them from the four rivers, defeats the four māras, shows all beings a smiling countenance, pleases all beings, genuinely develops the mind of precious insight, ensures that the lineage of the Three Jewels continues, defeats all false teachers, pulverizes the fangs of the afflictions, is the dhāraṇī that protects with the mantras of the threefold secret, sees all phenomena, liberates from the burden of the afflictions, eliminates all fear and anxiety, sees the vast and profound Dharma, acts with the strength of a lion, sustains all beings, traverses the path to nirvāṇa, spurns the left-hand path, and gets beings on the right-hand path.

source: །དེ་ལྟར་ཡེ་ཤེས་རིན་པོ་ཆེ་དང་ལྡན་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དང་། བསམ་པ་དང་། ཆོ་ག་ཤེས་པའོ།
en: “Someone who has such precious wisdom knows the activities, thoughts, and actions of all beings;

source: །མངོན་པར་ཤེས་པ་ལྔ་རྟོགས་པར་ཁོང་དུ་ཆུད་པའོ།
en: masters the five higher knowledges;

source: །བསམ་གཏན་རྩེ་གཅིག་པ་ལ་དགའ་བའོ།
en: delights in single-pointed concentration;

source: །འཕགས་པའི་བདེན་པ་བཞིའི་ཁ་དང་ལྡན་པའོ།
en: and possesses the four noble truths.

source: །སྤྱན་ལྔའི་མིག་བཟང་པོ་དང་ལྡན་པའོ།
en: That person has the five excellent eyes;

source: །ནམ་མཁའི་དཀྱིལ་མཐའ་དག་གི་ལུས་དང་ལྡན་པའོ།
en: has a body of the entire field of space;

source: །ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པའི་དཔྲལ་བ་དང་ལྡན་པའོ།
en: has a forehead equal to the realm of phenomena;

source: །དེ་བཞིན་ཉིད་ཀྱི་མགྲིན་པ་དང་ལྡན་པའོ།
en: has the throat of thusness;

source: །མི་སྐྱེ་བའི་ལྕེ་དང་ལྡན་པའོ།
en: has the unborn tongue;

source: །མཉམ་པ་ཉིད་དང་རོ་གཅིག་པའོ།
en: is of one taste with equality;

source: །ཆོས་ཐམས་ཅད་ལ་ཐོས་པ་འཛིན་པའོ།
en: possesses the learning of all teachings;

source: །སྒྲ་ཐམས་ཅད་རྟོགས་པའི་ཐོས་པ་དང་ལྡན་པའོ།
en: has a learning that understands all sounds;

source: །དྲི་ལ་རྗེས་སུ་ཆགས་པ་མེད་པའོ།
en: is not attached to scents;

source: །དྲི་ལ་ཁོང་ཁྲོ་བ་མེད་པའོ།
en: is not angry toward scents;

source: །དྲི་ཐམས་ཅད་རིག་པའོ།
en: knows all scents;

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞིའི་མགོ་བོ་དང་ལྡན་པའོ།
en: has the head of the four applications of mindfulness;

source: །ཚངས་པའི་གནས་པ་བཞིའི་སྐྲ་དྲི་ཞིམ་པོ་དང་ལྡན་པའོ།
en: has the sweet-scented hair of the four abodes of Brahmā;

source: །རྣམ་པར་ཐར་པ་གསུམ་གྱི་གཙུག་ཕུད་དང་ལྡན་པའོ།
en: has the crown of the three liberations;

source: །ཡང་དག་པར་སྤོང་བ་བཞིའི་ཐལ་གོང་ཤིན་ཏུ་རྒྱས་པ་དང་ལྡན་པའོ།
en: has the expansive clavicles of the four correct abandonments;

source: །རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞིའི་དཔུང་མགོ་དང་ལྡན་པའོ།
en: has the shoulders of the four bases of miraculous absorption;

source: །སྟོབས་ལྔའི་ཐོང་ཀ་ཤིན་ཏུ་ཡངས་པ་དང་ལྡན་པའོ།
en: has the wide chest of the five strengths;

source: །དབང་པོ་ལྔའི་ལྟེ་བ་ཤིན་ཏུ་ཟབ་པ་དང་ལྡན་པའོ།
en: has the deep navel of the five faculties;

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གྱི་ལྟོ་བ་དང་ལྡན་པའོ།
en: has the stomach of the seven branches of awakening;

source: །ལམ་ཡན་ལག་བརྒྱད་པའི་སྟ་ཟུར་དང་ལྡན་པའོ།
en: has the hips of the eight aspects of the path;

source: །ཡེ་ཤེས་མཐའ་ཡས་པའི་སྤུའི་ཁུང་བུ་དང་ལྡན་པའོ།
en: has the pores of infinite wisdom;

source: །དགེ་བའི་རྩ་བ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འདྲེན་པའི་ལག་པ་དང་ལྡན་པའོ།
en: has hands that guide the abundant roots of virtue;

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལེགས་པར་སྲུང་བའི་སོར་མོ་དང་ལྡན་པའོ།
en: has fingers that guard the path of the ten virtuous actions;

source: །ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་དག་པའི་ཆོས་ཉིད་མཐོང་བ་དང་། སྒོམ་པའི་སེན་མོ་དང་ལྡན་པའོ།
en: has nails that see and cultivate the reality of intrinsic purity;

source: །ཆོས་ཐམས་ཅད་ལ་སོམ་ཉི་མེད་པའི་རྩི་བ་ལོགས་དང་ལྡན་པའོ།
en: has ribs of no hesitation with respect to any phenomenon;

source: །སའི་རིམ་པའི་ཚུལ་ཐོབ་པའི་སྒལ་ཚིགས་དང་ལྡན་པའོ།
en: has the spine of the gradual attainment of the levels

source: །དུས་ལས་མི་འདའ་བར་ཆོས་སྟོན་པའི་སྟོབས་དང་ལྡན་པའོ།
en: has the strength of teaching the Dharma in a timely manner;

source: །བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་ཡོངས་སུ་སྦྱང་བ་ལེགས་པར་བྱས་པའི་ཞི་གནས་དང་ལྷག་མཐོང་གི་བརླ་དང་ལྡན་པའོ།
en: has the thighs of tranquility and special insight from having excellently trained in all the concentrations, freedoms, absorptions, and attainments;

source: །ཆོས་ཀྱི་ངེས་པ་ལ་འཇུག་པའི་པུས་མོ་དང་ལྡན་པའོ།
en: has the knees of entering into certainty about the Dharma;

source: །ཆོས་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པའི་རྗེ་ངར་དང་ལྡན་པའོ།
en: has the calves that teach the Dharma just as it should be;

source: །ཆོས་རྟོགས་པས་བསྲུངས་པའི་རྣམ་པའི་དྲན་པ་དང་ལྡན་པའོ།
en: has the mindfulness that stands on guard through realizing the Dharma;

source: །ཉོན་མོངས་པ་ཐམས་ཅད་ལས་རྣམ་པར་རྒྱལ་བའི་ལོང་བུ་དང་ལྡན་པའོ།
en: has the ankles of achieving victory over the afflictions;

source: །ཕྱོགས་བཅུར་འགྲོ་བའི་རྐང་པ་དང་ལྡན་པའོ།
en: has feet that tread in the ten directions;

source: །བསྟན་པ་མཚམས་འབྱོར་བར་འགྲོ་ཞིང་འོང་བ་དང་ལྡན་པའོ།
en: and has the coming and going that is in sync with the teachings.

source: །ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པའི་གོས་གྱོན་པའོ།
en: That person wears the clothes of modesty and moral shame;

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཆོས་ཀྱི་མེ་ཏོག་གི་ཕྲེང་བས་བརྒྱན་པའོ།
en: is adorned with the flower garland of the factors of awakening;

source: །ཤིན་ཏུ་རྣམ་པར་སྤེལ་བའི་ཚིག་གིས་ཆོས་སྟོན་པའོ།
en: teaches the Dharma with proliferating words;

source: །འཐུན་པ་དང་མི་འཐུན་པ་དང་བྲལ་བའོ།
en: is beyond the appropriate and inappropriate;

source: །འཆི་འཕོ་དང་། འགྲོ་བ་དང་། སྐྱེ་བའི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། མངོན་པར་ཤེས་པ་ཟབ་མོའི་ཕྱེ་མའི་བསྒོ་བས་བསྒོས་པའོ།
en: is infused with the scented powder of the profound knowledge, wisdom, and higher knowledges of death and transmigration, becoming and birth;

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་མཐའ་ཡས་པའི་བྱུག་པ་དང་ལྡན་པའོ།
en: has the salve of infinitely great discipline;

source: །ཚངས་པའི་གཡོག་འཁོར་དང་ལྡན་པའོ།
en: has Brahmā’s retinue;

source: །ཚངས་པའི་ལམ་མྱ་ངན་ལས་འདས་པའི་ལམ་དང་ལྡན་པའོ།
en: and has the Brahmā path—the path to the transcendence of suffering.

source: །ལམ་བཟང་པོ་སྟོན་པའོ། །ཐར་པའི་ལམ་དུ་ཁྲིད་པའོ། །འགྲོགས་ན་བདེ་བའི་མཛའ་བཤེས་དང་། མཛའ་བོའི་མཆོག་དང་ལྡན་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྩ་ལག་གོ། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕན་པ་ཚོལ་བའོ། །སྐྱེས་བུ་མཆོག་གོ །སྐྱེས་བུ་ཆེན་པོའོ། །སྐྱེས་བུ་དམ་པའོ། །སྐྱེས་བུ་ཁྱུ་མཆོག་གོ །སྐྱེས་བུ་སེང་གེའོ། །སྐྱེས་བུ་པད་མའོ། །སྐྱེས་བུ་པད་མ་དཀར་པོའོ། །སྐྱེས་བུ་གཅེས་པ་འཛིན་པའོ། །སྐྱེས་བུ་གཙོ་བོའོ། །སྐྱེས་བུ་ཅང་ཤེས་སོ།
en: That person teaches the excellent path, is a guide to the path of liberation, is the finest and friendliest friend and companion, is the kin of all beings, has great compassion, seeks the benefit of all beings, is a supreme being, is a great being, is a sublime being, is a foremost being, is a leonine being, is a pink-lotus-like being, is a white-lotus-like being, is a cherished being, is a chief being, and is a being of noble birth.

source: །སེམས་ཅན་ཐམས་ཅད་ཕོངས་པ་དང་། སྡུག་བསྔལ་བ་ལས་ཐར་བར་བྱེད་པའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའོ། །སེམས་ཅན་ཐམས་ཅད་ངེས་པར་སྒྲོལ་བའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་བག་ཆགས་གཅོད་པའོ། །བདུད་རྩིའི་ཆོས་ཀྱི་མཆོག་སྟོན་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་འཛིན་པའོ། །ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པ་ཐོབ་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདག་པོའོ།
en: That person frees beings from poverty and misery, cares for all beings, liberates all beings, eliminates the tendency for affliction in all beings, teaches the supreme teaching among the nectar-like Dharma, genuinely upholds the bodhisattvas’ great vehicle, and achieves mastery over all things.

source: །ཕ་མ་དང་ཉེ་དུར་གྱུར་པའོ། །འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ལས་ཡང་དག་པར་འདས་པའོ། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཐུན་པའོ། །ཆོས་ཀྱི་དབང་ཕྱུག་གོ །སེམས་ལ་དབང་བྱེད་པའོ། །བསྟན་བཅོས་དང་ཡི་གེ་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །བྱང་ཆུབ་དང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དེའི་སེམས་ཀྱི་གྲོགས་བྱེད་པའོ།
en: That person is the lord of all beings, is a parent and a relative, has truly transcended the eight worldly concerns, is in harmony with the whole world, is a master of the Dharma, controls the mind, is the sublime perfection of all sciences and scripts, and makes awakening and omniscience the mind’s companions.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་གོས་དང་། ཟས་དང་། སྐོམ་དང་། བཟའ་བའི་བྱ་བ་བྱེད་པའོ།
en: “The perfection of generosity provides beings’ clothes, food, and drink.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་དུས་ཚིགས་ཀྱི་བདེ་བ་བྱེད་པའོ།
en: The perfection of discipline provides their timely well-being.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་ཐམས་ཅད་ལས་མི་འཇིགས་པར་བྱེད་པའོ།
en: The perfection of patience provides their complete fearlessness.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་ལེགས་པར་བྱ་བའི་ལས་བྱེད་པའོ།
en: The perfection of diligence provides for their engagement in positive deeds.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་འགྱོད་པ་མེད་པར་བྱེད་པ་དང་། ཉེ་བར་ཞི་བར་བྱེད་པའོ།
en: The perfection of concentration provides for their calmness and lack of regret.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱེད་པའོ།
en: The perfection of insight provides for their purification of all phenomena.

source: །ཐབས་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་གཉི་གའི་དོན་བྱེད་པའོ།
en: The perfection of skill in means provides for the benefit of both self and other.

source: །སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་ཅི་འདོད་པའི་དོན་ཡང་དག་པར་ཐོབ་པར་བྱེད་པའོ།
en: The perfection of aspiration provides for beings’ achieving whatever they wish for.

source: །སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་འཇོམས་པར་བྱེད་པའོ།
en: The perfection of strength provides for their defeat of all afflictions.

source: །ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེའི་དུས་གསུམ་ལ་ཡེ་ཤེས་ཐོགས་པ་མེད་པར་བྱེད་པའོ།
en: The perfection of wisdom provides for their wisdom being unobstructed throughout the three times.

source: །བྱམས་པ་ནི་དེའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕན་པ་སྒྲུབ་པར་བྱེད་པའོ།
en: Love provides for accomplishing what benefits all beings.

source: །སྙིང་རྗེ་ནི་དེའི་སེམས་ཅན་ཐམས་ཅད་ལ་སྡུག་བསྔལ་སེལ་བར་བྱེད་པའོ།
en: Compassion provides for dispelling the suffering of beings.

source: །དགའ་བ་ནི་དེའི་རངས་པ་དང་དགའ་བར་བྱེད་པའོ།
en: Joy provides for their well-being and joy.

source: །བཏང་སྙོམས་ནི་དེའི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བར་བྱེད་པའོ།
en: Equanimity provides for their abandonment of attachment and anger.

source: །བདེན་པའི་གཏམ་ནི་དེའི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་སླུ་བར་བྱེད་པ་སྟེ།
en: True speech provides for nondeception in all these beings’ worlds.

source: ཀླུའི་བདག་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཁ་དོག་ནི་ལུས་ཡིན་ནོ།
en: “Nāga Lord, these are the outer appearances related to the inexhaustible casket dhāraṇī, and they constitute its body.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གཟུངས་འདིས་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བ་དེ་ནི་རྒྱལ་པོ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་མགོ་བོར་གྱུར་པ་ལྟ་བུ་ཡིན་ནོ། །བརྒྱ་བྱིན་རི་རབ་ཀྱི་ཟོམ་ན་བདག་པོར་འགྱུར་བ་ལྟ་བུ་ཡང་ཡིན་ནོ། །ཚངས་པ་ལྟ་བུར་ཚངས་པར་གྱུར་པ་ཡང་ཡིན་ནོ། །ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་ལྟ་བུར་ལུས་ཁྱད་པར་དུ་འཕགས་པ་ཡང་ཡིན་ནོ།
en: Any bodhisattvas who find joy in the Dharma through this dhāraṇī are like a king who is the harem’s center of attention, like Śakra who is the lord on Mount Meru, like Brahmā in the Brahmā realm, like the lord of the asuras Rāhu in his distinguished realm.

source: །རྒྱ་མཚོ་གཏིང་དཔག་དཀའ་ཞིང་མུ་མེད་པ་ལྟ་བུ་ཡང་ཡིན་ནོ། །རི་རབ་ལྟ་བུར་བསོད་ནམས་དག་གིས་མངོན་པར་འཕགས་པ་ཡང་ཡིན་ནོ།
en: They are like the ocean in being boundless and difficult to fathom, like Mount Meru in being exalted by their merits.

source: །ལྷ་རྣམས་ཀྱི་སྙིང་དུ་སྡུག་པ་དང་། ཡིད་དུ་འོང་བ་ཡང་ཡིན་ནོ།
en: They are the sweetheart and favorite of the gods.

source: །ཕ་མའི་བུ་གཅིག་པ་ལྟ་བུ་ཡང་ཡིན་ནོ།
en: They are like a father and mother’s only child.

source: །ནམ་མཁའི་དཀྱིལ་ན་ཟླ་བ་ཉ་བ་འདུག་པ་ལྟ་བུར་བལྟ་ན་སྡུག་པ་ཡང་ཡིན་ནོ།
en: They are pleasing to behold like the full moon in the midst of the sky.

source: །སྟོན་པ་ལྟ་བུར་ལྷ་དང་མི་རྣམས་ཀྱིས་ཕྱག་བྱས་པའི་གནས་ཀྱང་ཡིན་ནོ།
en: Like the Teacher, they are an object of the veneration of gods and humans.

source: །ཉི་མ་ཤར་བ་ལྟ་བུར་སྣང་བ་བྱེད་པ་ཡང་ཡིན་ནོ།
en: They are illuminating like the rising of the sun.

source: །ནགས་ན་འདུག་པའི་རྨ་བྱ་ལྟ་བུར་སྐད་སྙན་པ་ཡང་ཡིན་ནོ།
en: Their voice is pleasing like the peacock living in the forest.

source: །རིའི་ཕུག་ན་འདུག་པའི་སེང་གེ་ལྟ་བུར་ཆོས་ཀྱི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་ཡང་ཡིན་ནོ།
en: Their roar of Dharma resounds like a lion’s in a mountain cave.

source: །སེམས་ཤིན་ཏུ་དུལ་བའི་གླང་པོ་ཆེ་ལྟ་བུར་ཅང་ཤེས་ཀྱི་ཟས་ལ་ལོངས་སྤྱོད་པ་ཡང་ཡིན་ནོ།
en: They enjoy the food of the high born like the gentle-minded elephant.

source: །ཆོས་ཀྱི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ་ལྟ་བུར་ཆོས་ཀྱི་རྒྱལ་སྲིད་སྟོན་པ་ཡང་ཡིན་ནོ།
en: They instruct the Dharma kingdom like a universal Dharma king.

source: །ཀླུའི་ཚོགས་རྩེ་བ་ལྟ་བུར་ཆོས་ཀྱི་སྤྲིན་འགྱེད་པ་ཡང་ཡིན་ནོ།
en: They spread clouds of Dharma like a playful group of nāgas.

source: །ཀླུའི་བདག་པོ་ཆར་ཆེན་པོ་འབེབས་པ་ལྟ་བུར་ཆོས་ཀྱི་འབྲུག་སྒྲ་མངོན་པར་སྒྲོགས་པ་ཡང་ཡིན་ནོ།
en: They sound the thunder of Dharma like a nāga lord causing a rain shower.

source: །བརྒྱ་བྱིན་ལྟ་བུར་དུས་སུ་ཆོས་ཀྱི་ཆར་ཆེན་པོ་འབེབས་པ་ཡང་ཡིན་ནོ།
en: They make the timely Dharma-rain fall like Śakra.

source: །དཔའ་བོས་གཞན་གྱི་དམག་ལ་བྱ་བ་ལྟ་བུར་མུ་སྟེགས་ཅན་ཐམས་ཅད་སྐྲག་པར་བྱེད་པ་ཡང་ཡིན་ནོ།
en: They terrify all extremists like a hero dealing with an opposing army.

source: །ཆུའི་རྒྱུན་གྱིས་མེ་ལ་བྱ་བ་ལྟ་བུར་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་ཡང་ཡིན་ནོ།
en: They quell all afflictions like a torrent of water putting out a fire.

source: །རླུང་གིས་ཕུབ་མ་སྤར་གང་ལ་བྱ་བ་ལྟ་བུར་བདུད་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་ཡང་ཡིན་ནོ།
en: They overwhelm all nāgas like the wind blowing away a handful of straw.

source: །མ་མས་བྱིས་པ་ལ་བྱ་བ་ལྟ་བུར་སེམས་ཅན་ཐམས་ཅད་དང་འཐུན་པར་བྱེད་པ་ཡང་ཡིན་ནོ།
en: They take care of all beings like a mother caring for a child.

source: །ས་གཞི་རྫས་རྣམས་ཀྱིས་མི་བསྐྱོད་པ་ལྟ་བུར་བདེ་བ་དང་སྡུག་བསྔལ་རྣམས་ཀྱིས་མི་བསྐྱོད་པ་ཡང་ཡིན་ནོ།
en: They are unmoved by pleasure or pain in the way the earth is unaffected by things placed upon it.

source: །རླུང་གིས་ཤིང་གི་ལོ་མ་རྣམས་ལ་བྱ་བ་ལྟ་བུར་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་གཡོ་བར་བྱེད་པ་ཡང་ཡིན་ནོ།
en: They rattle all false teachers like the wind rattling the leaves of a tree.

source: །རྣམ་ཐོས་ཀྱི་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་འབྱོར་བ་ལྟ་བུར་ཆོས་ཀྱི་ནོར་འཐུན་པར་སྦྱིན་པ་ཡང་ཡིན་ནོ།
en: They appropriately distribute the wealth of Dharma like Vaiśravaṇa, who is rich with all kinds of jewels.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱི་བཀོད་པའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ལྟ་བུར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡང་ཡིན་ཏེ།
en: They fulfill all beings’ wishes like the wish-fulfilling jewel known as heart of all beings

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་གནས་པ་ཞེས་བརྗོད་དོ།
en: Therefore, Nāga Lord, it is said that a bodhisattva who adheres to the inexhaustible casket dhāraṇī abides at the seat of awakening.

source: །ཀླུའི་བདག་པོ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་རིན་པོ་ཆེ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཟ་མ་ཏོག་ཡིན་པ་དེ་བཞིན་དུ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཟ་མ་ཏོག་ཡིན་ནོ།
en: “To give an analogy, Nāga Lord: a bodhisattva who abides in the inexhaustible casket dhāraṇī is the source and repository of all qualities in the same way that the ocean is the source and repository of all jewels.

source: །ཀླུའི་བདག་པོ་དཔེར་ན་སྤོས་བརྒྱ་ཕྲག་དུ་མ་ཡོད་པའི་སྤོས་ཀྱི་ཟ་མ་ཏོག་ནི་སེམས་ཅན་ཐམས་ཅད་སྤོས་ཀྱིས་ཡོངས་སུ་མགུ་བར་བྱེད་པ་དེ་བཞིན་དུ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ལེགས་པར་སྨྲ་བས་ཡང་དག་པར་མགུ་བར་བྱེད་དོ།
en: To give an analogy, Nāga Lord: a bodhisattva who adheres to the inexhaustible casket dhāraṇī pleases all beings with excellent speech the way a container filled with hundreds of different incenses pleases the tastes of all beings for incense.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་གཟུངས་འདི་ནི་སྒྲ་ཐམས་ཅད་ལ་འཇུག་པ་སྟེ།
en: “Moreover, Nāga Lord, this dhāraṇī can be applied in any language.

source: འདི་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གདུགས་གཅིག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་ཟད་པ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་མཉམ་པར་བཞག་པ་ཞེས་བྱའོ།
en: Thus, what is known here as the mind set on awakening is known as composure in the world called Inexhaustible , the buddha realm of the single Thus-Gone One Jeweled Parasol

source: །འདི་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་ཀྱི་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཁྱད་པར་བསྡུས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱའོ།
en: What is known here as omniscience is known as all endowed in the world called Combining Special Features, the buddha realm of the Thus-Gone One Nārāyaṇa.

source: །འདི་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་གྲུབ་པར་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཞི་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གཟི་བྱིན་ཅན་ཞེས་བྱའོ།
en: What is known here as the perfection of generosity is known as splendorous in the world called Peace , the buddha realm of the Thus-Gone One Gone to Accomplishment.

source: །འདི་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་དང་བྲལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་མྱ་ངན་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ལེགས་སོ་ཞེས་བྱ་བའི་ཚུལ་ཞེས་བྱའོ།
en: What is known here as the perfection of discipline is known as the method called “excellent” in the world called Without Misery, the buddha realm of the Thus-Gone One Free from Misery.

source: །འདི་ན་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པའི་ཞལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་དྲི་མ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་རྒྱ་ཆེན་པོ་མི་ཟད་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: What is known here as the perfection of patience is known as unending expansiveness in the world called Immaculate , the buddha realm of the Thus-Gone One Immaculate Visage.

source: །འདི་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་འོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྒྲོལ་བར་བྱེད་པ་ཞེས་བྱའོ།
en: What is known here as the perfection of diligence is known as liberating in the world called All-Illuminating, the buddha realm of the Thus-Gone One Stainless Light.

source: །འདི་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་བསྟན་པའི་སྙིང་པོ་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་སྙིང་པོ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཉེ་བར་ཞི་བར་སྤྱོད་པ་ཞེས་བྱའོ།
en: What is known here as the perfection of concentration is known as peaceful conduct in the world called Essential , the buddha realm of the Thus-Gone One Heart of the Doctrine.

source: །འདི་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་སྤྲིན་དང་ལྡན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ།
en: What is known here as the perfection of insight is known as complete purity in the world called Cloudy, the buddha realm of the Thus-Gone One Cloud King.

source: །འདི་ན་ཐབས་མཁས་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཕྱག་དྲི་མ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མཆོག་དམ་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་འཇིག་རྟེན་དང་འཐུན་པ་ཞེས་བྱའོ།
en: What is known here as skill in means is known as attuned to the world in the world called True Eminence, the buddha realm of the Thus-Gone One Immaculate Hand.

source: །འདི་ན་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ལེགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཕན་པ་དང་། ཡིད་དུ་འོང་བ་དང་། ཐུབ་པ་དང་གཉི་ག་ལས་ཞི་བ་ཞེས་བྱའོ།
en: “What are known here as love, compassion, joy, and equanimity are known as beneficial, pleasing, enabling, and quelling dualism in the world called Excellent , the buddha realm of the Thus-Gone One Siddhārtha.
